In [1]:
# 7.1 Handling Missing Data

In [2]:
# for data with float64 dtype, pandas uses the floating-point value NaN (Not a Number) to represent misssing data
# this is called  asentienl value; when present, it indicates a missing (or null) value
import pandas as pd
import numpy as np

float_data = pd.Series([1.2,-3.5,np.nan,0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [3]:
# .isna() gives a Boolean Series of result; null = TRUE
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
# as alternative to 'NA', a built-in 'None' (case-sensitive) value is also used
string_data = pd.Series(["aardvark",np.nan,None,"avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [5]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [6]:
float_data = pd.Series([1,2,None],dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [7]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [8]:
# NA handling object methods
# .dropna() : filter axis labels based on whether values for eahc label have missing data
#          with varying thresholds for how much missing data to tolerate
# .fillna() : fill in missing data with some value or using an interpolation method such as "ffill" or "bfill"
# .isna() : return Boolean values indicating which values are missing/NA
# .notna() : negation of isna, returns True for non-NA values and False for NA values

In [9]:
# Filtering Out Missing Data

In [10]:
# using .dropna() in Series
data = pd.Series([1,np.nan,3.5,np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
# another way to filter out missing data in Series
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
# removing missing data in DataFrames - either drop rows or columns that are all NA, or only dropping rows or columns containing any NA
# .dropna() by default drops any row containing a missing value
data = pd.DataFrame([[1,6.5,3.],[1.,np.nan,np.nan],
                     [np.nan,np.nan,np.nan],[np.nan,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data.dropna()
# drops all the rows containing any NA

     0    1    2
0  1.0  6.5  3.0

In [15]:
# passing how = "all" will drop only rows that are all NA
data.dropna(how="all")

# these functions don't modify the original object, just creates a new object

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
# to drop columns containing NA, pass the argument axis = "columns"
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis="columns",how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
# only keeping rows contianing at most a certain number of missing observations
# indicate this with the thresh argument
df = pd.DataFrame(np.random.standard_normal((7,3)))
df

          0         1         2
0  0.473784  1.742141  0.379653
1  0.065078  1.071937 -0.792601
2  0.375331  0.099308  0.219374
3 -1.094179  1.733277 -0.837715
4  1.046318  0.213018 -1.216324
5 -0.560386  1.502222  1.013939
6 -1.637215 -0.981678 -0.283789

In [19]:
df.iloc[:4,1] = np.nan
df.iloc[:2,2] = np.nan
df

          0         1         2
0  0.473784       NaN       NaN
1  0.065078       NaN       NaN
2  0.375331       NaN  0.219374
3 -1.094179       NaN -0.837715
4  1.046318  0.213018 -1.216324
5 -0.560386  1.502222  1.013939
6 -1.637215 -0.981678 -0.283789

In [20]:
df.dropna()

          0         1         2
4  1.046318  0.213018 -1.216324
5 -0.560386  1.502222  1.013939
6 -1.637215 -0.981678 -0.283789

In [21]:
# using argument thresh
df.dropna(thresh=2)
# thresh = 2 means non-NaN threshold is 2 (at least 2 non-NaN values), if threshold not met, drop
# thresh = N means the row needs N "votes" to stay in the DataFrame

          0         1         2
2  0.375331       NaN  0.219374
3 -1.094179       NaN -0.837715
4  1.046318  0.213018 -1.216324
5 -0.560386  1.502222  1.013939
6 -1.637215 -0.981678 -0.283789

In [22]:
# Filling In Missing Data

In [23]:
# .fillna() : filling NaN with a constant
df.fillna(0)

          0         1         2
0  0.473784  0.000000  0.000000
1  0.065078  0.000000  0.000000
2  0.375331  0.000000  0.219374
3 -1.094179  0.000000 -0.837715
4  1.046318  0.213018 -1.216324
5 -0.560386  1.502222  1.013939
6 -1.637215 -0.981678 -0.283789

In [24]:
# using fillna() with a dictioinary, can use a different fill value for each column
df.fillna({1:0.5,2:0})

          0         1         2
0  0.473784  0.500000  0.000000
1  0.065078  0.500000  0.000000
2  0.375331  0.500000  0.219374
3 -1.094179  0.500000 -0.837715
4  1.046318  0.213018 -1.216324
5 -0.560386  1.502222  1.013939
6 -1.637215 -0.981678 -0.283789

In [25]:
# the same interpolation methods available for reindexing can be used with fillna()
df = pd.DataFrame(np.random.standard_normal((6,3)))
df

          0         1         2
0  0.998390 -0.679905  1.650758
1  2.102404 -0.200562  0.808540
2  0.515568  0.426512 -0.190902
3 -0.924331 -1.306145 -1.777451
4 -0.033609 -0.142241 -1.840101
5  0.432827 -0.159665 -0.217702

In [26]:
df.iloc[2:,1] = np.nan
df

          0         1         2
0  0.998390 -0.679905  1.650758
1  2.102404 -0.200562  0.808540
2  0.515568       NaN -0.190902
3 -0.924331       NaN -1.777451
4 -0.033609       NaN -1.840101
5  0.432827       NaN -0.217702

In [27]:
df.iloc[4:,2] = np.nan
df

          0         1         2
0  0.998390 -0.679905  1.650758
1  2.102404 -0.200562  0.808540
2  0.515568       NaN -0.190902
3 -0.924331       NaN -1.777451
4 -0.033609       NaN       NaN
5  0.432827       NaN       NaN

In [28]:
df.fillna(method="ffill")
# "ffill" means forward fill; as in Excel "Duplicate Down"
# the NaN values are filled with the preceding non-NaN values, however, ffill stops when it hits a new non-NaN value
# opposite of "ffill" is "bfill" (back fill)

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_9596\1120536992.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0  0.998390 -0.679905  1.650758
1  2.102404 -0.200562  0.808540
2  0.515568 -0.200562 -0.190902
3 -0.924331 -0.200562 -1.777451
4 -0.033609 -0.200562 -1.777451
5  0.432827 -0.200562 -1.777451

In [29]:
df.fillna(method="ffill",limit=2)

# "limit = 2" means limit the fill to 2 rows

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_9596\2927788966.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill",limit=2)

          0         1         2
0  0.998390 -0.679905  1.650758
1  2.102404 -0.200562  0.808540
2  0.515568 -0.200562 -0.190902
3 -0.924331 -0.200562 -1.777451
4 -0.033609       NaN -1.777451
5  0.432827       NaN -1.777451

In [30]:
# with .fillna() simple data imputation using median or mean statistics is available
data = pd.Series([1,np.nan,3.5,np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [31]:
data.fillna(data.mean())
# fill the NaN values with .mean()

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [32]:
# .fillna() function arguments
# value : scalar value or dictionary-like object to use to fill missing values
# method : interpolation method - one of "bfill" or "ffill"; default is None
# axis : axis to fill on ("index" or "columns"); default is axis="index"
# limit : for ffill and bfill, maximum number of consecutive periods to fill

In [33]:
# Data Transformation

In [34]:
# Removing Duplicates

In [35]:
# removing duplicate rows
data = pd.DataFrame({"k1":["one","two"]*3 + ["two"],"k2":[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [36]:
# DataFrame .duplicated() method returns a Boolean Series indicating whether each row is a duplicate oe nor
# duplicate means its column values are exactly equal to those in an earlier row
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [37]:
# relatedly, drop_duplicates() returns a DataFrame with rows where the duplicated array is False filtered out
data.drop_duplicates()

# both methods, .duplicated() and .drop_duplicates() by default consider all of the columns;
# alternatively, can specify any subset of them to detect duplicates

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [38]:
# having an additional column of values, and want to filter duplicates based only on the "k1" column
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [39]:
# set column with subset argument
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [40]:
# .duplicated() and .drop_duplicates() by default keep the first observed value combination
# passing keep="last" argument will return the last one
data.drop_duplicates(["k1","k2"],keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [41]:
# Transformming Dta Using a Function or Mapping
# transformation based on the values in an array, Series, or column in a DataFrame
data = pd.DataFrame({"food":["bacon","pulled pork","bacon","pastrami","corned beef","bacon","pastrami","honey ham","nova lox"],
                     "ounces":[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [42]:
# suppose we wanted to add a column indicating the type of animal for each food
meat_to_animal = {
    "bacon": "pig",
    "pulled pork": "pig",
    "pastrami": "cow",
    "corned beef": "cow",
    "honey ham": "pig",
    "nova lox": "salmon"
}

meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [43]:
# .map() method on a Series accepts a function or dictionary-like object containing a mapping
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [44]:
# could also have passed a function that does all the work
def get_animal(x):
    return meat_to_animal[x]

data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [45]:
# using .map() is a convenient way to perform element-wise transformatioins and other data cleaning-related operations

In [46]:
# Replacing Values
# .map() can be used to modify a subset of values in an object,
# but .replace() provides a simpler and more flexible way
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [47]:
# using "-999" values as sentinel values for missing data - replacing those with NA values
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [48]:
# replacing multiple values at once - passing a list with substitute values
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [49]:
# replacing different values for each, pass a list of substitutes
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [50]:
# passing argument can also be a dictionary
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [51]:
# renaming axis indexes
# axis labels can be similarly transformed by a function or mapping of some form to produce new, differently labeled objects
# modifying the axes in place without creating a new data structure
data = pd.DataFrame(np.arange(12).reshape((3,4)),
        index = ["ohio","Colorado","New York"],
        columns = ["one","two","three","four"])
data

          one  two  three  four
ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [52]:
# .map() method for axis indexes, just like in Series
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [53]:
# can assign to the index attribute, modifying the DataFrame in place
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [54]:
# if wanting to create a transformed version without modifying the origina, .renam() can be used
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [55]:
# .rename() can be used in conjuction with a dictionary-like object
data.rename(index={"OHIO":"INDIANA"},
           columns={"three":"peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [56]:
# Discretization and Binning
# data about a group of people in a study, gropuping them into discreet age buckets
ages = [20,22,25,27,21,23,37,31,61,45,41,32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [57]:
# bins = 18 to 25, 26 to 35, 36 to 60, and 61 and older
# use pd.cut()
bins = [18,25,35,60,100]
age_categories = pd.cute(ages,bins)
age_categories

AttributeError: module 'pandas' has no attribute 'cute'

In [ ]:
bins = [18,25,35,60,100]
age_categories = pd.cut(ages,bins)
age_categories
# each bin is identified by a special interval value type containing lower and upper limit of each bin

In [ ]:
# data codified in numberical integers (the "pointer" to the category)
age_categories.codes

In [ ]:
# index of unique labels created; telling what the buckets are called, the "reference table"
age_categories.categories

In [ ]:
age_categories.categories[0]

In [ ]:
# pd.value_counts() are the bin counts for the result of pd.cut()
pd.value_counts(age_categories)

In [ ]:
# in the string representation of an interval, a parenthesis means that the side is open (exclusive)
# square bracket means it's closed (inclusive)
# can change which side is closed by passing "right = False"
pd.cut(ages,bins,right=False)

In [ ]:
# can overrid the default interval-based bin labeling, by passing a list or arroy to the labels
group_names = ["Youth","YoungAdult","MiddleAged","Senior"]
pd.cut(ages,bins,labels=group_names)

In [ ]:
# passing an integer number of bins to pd.cut() instead of explicit bin edges,
# it will compute equal-length bins based on min and max values
data = np.random.uniform(size=20)
data

In [ ]:
pd.cut(data,4,precision=2)

In [ ]:
# pd.qcut() bins the data based on sample quantiles
# it will obtain roughly equally sized bins (slicing in quantiles)
data = np.random.standard_normal(1000)
data

In [ ]:
quartiles = pd.qcut(data,4,precision=2)
quartiles

In [ ]:
pd.value_counts(quartiles)

In [ ]:
# similar to pd.cut(), can pass own quantiles (between 0 and 1, inclusive)
pd.qcut(data,[0,0.1,0.5,0.9,1]).value_counts()

In [58]:
# Detecting and Filetering Outliers
# filtering and transforming relates applying array operations
data = pd.DataFrame(np.random.standard_normal((1000,4)))
data

            0         1         2         3
0    0.444406 -0.570342  1.151289  2.189161
1   -0.833805 -0.486284  1.422654  0.706201
2    1.060479  0.379973  0.366005 -1.095163
3    0.869405  0.830525  0.330968  0.085115
4   -0.925818  1.442622  0.024772  1.196579
..        ...       ...       ...       ...
995  0.334311  0.140288 -0.242538  0.159239
996 -0.313938 -0.954377 -0.007177  0.144704
997 -0.410706  0.753488 -0.976792  0.508967
998 -0.242740  0.416479 -0.631149  1.046563
999 -0.030534 -0.408984  1.128199  2.017052

[1000 rows x 4 columns]

In [59]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.021561     0.006809    -0.000084    -0.019877
std       0.980914     0.986525     0.998745     1.020983
min      -3.354359    -2.986572    -3.500774    -3.280590
25%      -0.621592    -0.664762    -0.652368    -0.662029
50%       0.020717     0.029252    -0.002264    -0.028043
75%       0.709346     0.646996     0.662446     0.661932
max       2.610847     3.853050     3.136201     2.874230

In [60]:
# filtering values in one of the columns exceeding 3 in absolute value
col = data[2]
col[col.abs() > 3]

688   -3.500774
699    3.136201
Name: 2, dtype: float64

In [61]:
# selecting rows having a value exceeding 3 or -3, can use any method on a Boolean DataFrame
data[(data.abs() > 3).any(axis="columns")]
# .any() asks if there is any TRUE value in the axis (axis="columns" in this case)
# .all() asks if all of the values TRUE

            0         1         2         3
120 -0.309166  1.242829 -1.490819 -3.179513
175 -0.825062 -1.241489 -0.894305 -3.122660
271 -0.313729 -0.435694 -0.406400 -3.058250
405 -3.100668  0.228027  0.371812 -1.496808
501 -3.354359  1.538787  0.405191 -0.737176
688 -1.042896  1.340432 -3.500774  0.947365
699  1.115030 -0.936691  3.136201  0.146517
855 -0.454441  3.051391  0.093581  0.020342
970 -0.866390  1.420969  1.149189 -3.280590
978 -0.521021  3.853050 -0.255936  0.935589

In [63]:
# capping values outside the interval -3 to 3
data[data.abs() > 3] = np.sign(data)*3
data

# np.sign(data) produces 1 and -1 values based on wheter the values in data are positive or negative

            0         1         2         3
0    0.444406 -0.570342  1.151289  2.189161
1   -0.833805 -0.486284  1.422654  0.706201
2    1.060479  0.379973  0.366005 -1.095163
3    0.869405  0.830525  0.330968  0.085115
4   -0.925818  1.442622  0.024772  1.196579
..        ...       ...       ...       ...
995  0.334311  0.140288 -0.242538  0.159239
996 -0.313938 -0.954377 -0.007177  0.144704
997 -0.410706  0.753488 -0.976792  0.508967
998 -0.242740  0.416479 -0.631149  1.046563
999 -0.030534 -0.408984  1.128199  2.017052

[1000 rows x 4 columns]

In [64]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.022016     0.005905     0.000280    -0.019236
std       0.979441     0.983402     0.996693     1.019045
min      -3.000000    -2.986572    -3.000000    -3.000000
25%      -0.621592    -0.664762    -0.652368    -0.662029
50%       0.020717     0.029252    -0.002264    -0.028043
75%       0.709346     0.646996     0.662446     0.661932
max       2.610847     3.000000     3.000000     2.874230

In [65]:
# np.sign(data) produces 1 and -1 values based on wheter the values in data are positive or negative
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0  1.0
1 -1.0 -1.0  1.0  1.0
2  1.0  1.0  1.0 -1.0
3  1.0  1.0  1.0  1.0
4 -1.0  1.0  1.0  1.0

In [66]:
# Permutation and Random Sampling
# permuting (randomly reordering) the rows in a DataFrame
# np.random.permuitation() with length of the axis wanting to permute prodcues an array of integers of new ordering
df = pd.DataFrame(np.arange(5*7).reshape((5,7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [67]:
sampler = np.random.permutation(5)
sampler

array([0, 3, 2, 4, 1], dtype=int32)

In [68]:
# array can then be used in iloc-based indexing or the equivalent .take() function
df.take(sampler)

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13

In [69]:
df.iloc[sampler]

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13

In [70]:
# by invoking .take() with axis="columns", can also select a permutation of the columns
column_sampler = np.random.permutation(7)
column_sampler

array([4, 3, 0, 2, 5, 1, 6], dtype=int32)

In [71]:
df.take(column_sampler,axis="columns")

    4   3   0   2   5   1   6
0   4   3   0   2   5   1   6
1  11  10   7   9  12   8  13
2  18  17  14  16  19  15  20
3  25  24  21  23  26  22  27
4  32  31  28  30  33  29  34

In [72]:
# np.random.permutation() is simply generating random array of integers in random order
np.random.permutation(15)

array([13,  1,  9,  2,  6, 11,  5,  0, 10,  3,  4, 14,  7, 12,  8],
      dtype=int32)

In [75]:
# to select a random subset without replacement (the same row cannot appear twice)
# can use .sample() on Series and DataFrame
# "n=" seems to be number of rows
df.sample(n=3)

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6

In [80]:
# to generate sample WITH replacement (to allow repeat choices)
# pass "replace=True" to .sample()
choices = pd.Series([5,7,-1,6,4])
choices.sample(n=10,replace=True)

0    5
2   -1
3    6
0    5
4    4
3    6
2   -1
0    5
4    4
2   -1
dtype: int64

In [83]:
# Computing Indicator / Dummy Variables
# common statistical modeling or machine learning application
# converting a categorical variable into a dummy or indicator matrix
# if column in a DataFrame has k distinct values, derive a matrix or DataFrame with k column containing all 1s and 0s
# pd.get_dummires() 
df = pd.DataFrame({"key":["b","b","a","c","a","b"],
                  "data1":range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [84]:
pd.get_dummies(df["key"])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [88]:
# in some cases, adding a prefix to the columns in the indicator DataFrame could be helpful
# prefix can e merged with the other data
# pd.get_dummies() has a prefix argument
dummies = pd.get_dummies(df["key"],prefix="shit")
dummies

   shit_a  shit_b  shit_c
0       0       1       0
1       0       1       0
2       1       0       0
3       0       0       1
4       1       0       0
5       0       1       0

In [89]:
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  shit_a  shit_b  shit_c
0      0       0       1       0
1      1       0       1       0
2      2       1       0       0
3      3       0       0       1
4      4       1       0       0
5      5       0       1       0

In [91]:
# if row in a DataFrame belongs to multiple categories, use different approach to create dummy varaiables
mnames = ["movie_id","title","genres"]

In [94]:
movies = pd.read_table("datasets/movielens/movies.dat",sep="::",
                      header=None,names=mnames,engine="python")
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [96]:
# pandas has a special Series method str.get_dummies() (methods that start with string)
# multiple group membership encoded as a delimited string
dummies = movies["genres"].str.get_dummies("|")
dummies

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,1,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0
2,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0
3,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
3879,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3880,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3881,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3882,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0

In [97]:
dummies.iloc[:10,:6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [99]:
# as before, can combine this with movies while adding a "Genre_" to the column names in dummies DataFrame
# .add_prefix()
movies_windic = movies.join(dummies.add_prefix("Genre_"))
movies_windic

,movie_id,title,genres,Genre_Action,Genre_Adventure,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Crime,Genre_Documentary,...,Genre_Fantasy,Genre_Film-Noir,Genre_Horror,Genre_Musical,Genre_Mystery,Genre_Romance,Genre_Sci-Fi,Genre_Thriller,Genre_War,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,0,0,1,1,1,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0,1,0,1,0,0,0,...,1,0,0,0,0,0,0,0,0,0
2,3,Grumpier Old Men (1995),Comedy|Romance,0,0,0,0,1,0,0,...,0,0,0,0,0,1,0,0,0,0
3,4,Waiting to Exhale (1995),Comedy|Drama,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Father of the Bride Part II (1995),Comedy,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
3879,3949,Requiem for a Dream (2000),Drama,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3880,3950,Tigerland (2000),Drama,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3881,3951,Two Family House (2000),Drama,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3882,3952,"Contender, The (2000)",Drama|Thriller,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0